import csv, time, subprocess, pywikibot, requests, os, பைவிக்கிமூலம்00
from bs4 import BeautifulSoup

#--------------------------குறிப்புகள்----------------------------------------------
# மாற்றம் தேவை: djvu கோப்புகளுக்கும் மாற்றம் செய்ய வேண்டும்.
# அட்டவணைத் தலைப்பினை ஆய்ந்து பகுப்பிட வேண்டும்.
# cat dictionary உருவாக்கி, இன்னும் வேகம்/நிரல்வரிச்சுருக்கம் செய்ய இயலுமா என வினவ வேண்டும்.
# மூன்றுக்கு மேற்பட்ட ஒரு அட்டவணையில் வந்தால் எப்படி செயற்படும்? எ-கா:அட்டவணை:கோவை இளஞ்சேரன் கவிதைகள்-1.pdf (தலைப்புமாற்றம், கவிதை, பக்கயெண்ணிக்கை)
#crontab கொண்டு, நாள்தோறும்/வாரந்தோறும், புதிய அட்டவணை மீது சோதிக்கும் படி செய்தல் வேண்டும்.
#--------------------------குறிப்புகள் முடிவு---------------------------------------------

# ------------  கோட்டிற்கு கீழுள்ளவை,  நிரலுக்கான முன்னேற்பாடுகள், பிறகு  இவை பின்னர் பயன்படக்கூடியன. ---------------------
விளைவிடு = print 
விளைவிடு()
பைவிமூ = பைவிக்கிமூலம்00
கோடிடு = பைவிமூ.கோடிடு(எண்ணிக்கை=70)
#-----------  கோட்டிற்கு மேலுள்ளவை. பின்வரும் நிரல்களில் பயன்படக்கூடியன. ------------------------------


# முதலில், கீழ்கண்ட 000.csv என்ற உள்ளீட்டுக்கோப்பு1-இல்  இருந்து, ஒவ்வொரு வரியாக நிரலால்  எடுக்கிறேன். 
with open('அட்டவணைகள்.txt', 'r') as உள்ளீட்டுக்கோப்பு:
	படித்தல் = csv.reader(உள்ளீட்டுக்கோப்பு,delimiter="~")
	for உள்ளீட்டுக்கோப்புவரி in படித்தல்:  # ஒவ்வொரு வரியாக எடுக்கிறேன்.
		subprocess.call("sed -i `` 1d அட்டவணைகள்.txt",shell=True) # உள்ளீட்டுக்கோப்பு1-இல், படித்த வரியை நீக்குகிறேன். 
		இடுஅட்டவணை = உள்ளீட்டுக்கோப்புவரி[0] # .decode('utf-8') # எடுக்கின்ற முதல்வரியில், delimiter அடிப்படையில் எடுக்கிறேன்.

		#அட்டவணைப்பெயர் சரிபார்க்கப்படுகிறது. ஏனெனில், கீழ்வரும் சிறப்புப்பக்கத்தில் இருந்து நகல் எடுக்கும்போது, முன்னொட்டு இல்லாமல் ஒட்டிவிட வாய்ப்புண்டு.
		##https://ta.wikisource.org/w/index.php?title=%E0%AE%9A%E0%AE%BF%E0%AE%B1%E0%AE%AA%E0%AF%8D%E0%AE%AA%E0%AF%81:IndexPages&limit=200&offset=2200&key=&order=size&sortascending=1
		if 'அட்டவணை:' in இடுஅட்டவணை or 'Index:' in இடுஅட்டவணை or 'index:' in இடுஅட்டவணை:
			print(இடுஅட்டவணை + ' (இடுஅட்டவணைப் பெயர் சரியாகவுள்ளது.)')
			time.sleep(15)

			# bs4 என்ற பைத்தான் நூற்கட்டகத்தின் வழியே, ஒவ்வொரு அட்டவணையிலுள்ள நூற்பக்கங்களைக் கணக்கிடுகிறேன். 
			இடுஅட்டவணைஉரலி = 'https://ta.wikisource.org/wiki/' + இடுஅட்டவணை
			இடுஉள்ளடக்கம் = requests.get(இடுஅட்டவணைஉரலி).content
			வடிச்சாறு = BeautifulSoup(இடுஉள்ளடக்கம்,'lxml')
			அட்டவணைப்பக்கங்கள் = வடிச்சாறு.title
			பக்கக்குறியீடுகள் = வடிச்சாறு.findAll('div', {'class' : 'prp-index-pagelist'})
			பக்கக்குறியீடுகளுரை1 = str(பக்கக்குறியீடுகள்).split('</a>')
			பக்கக்குறியீடுகள்பட்டி = len(பக்கக்குறியீடுகளுரை1)
			அட்டவணைமொத்தப்பக்கங்கள் = பக்கக்குறியீடுகள்பட்டி-1 
			print(str(அட்டவணைமொத்தப்பக்கங்கள்) + ' பக்கங்கள் உள்ளன.')
			
# ------------------- தொடக்கம்:   ஒரு அட்டவணையின் பெயரினைக் கொண்டு, உரியப் பகுப்புகளை இடுகிறேன்.----------------------------
			# pywikibot என்ற பைத்தான் நூற்கட்டகத்தின் வழியே, ஒரு அட்டவணைப் பெயரினைக் கொண்டு, உரியப் பகுப்புகளை இடுகிறேன்.
			மொழிதிட்டம்1 = pywikibot.Site('ta','wikisource')			
			உரலிபக்கம்1 = pywikibot.Page(மொழிதிட்டம்1,இடுஅட்டவணை)
			உரலிபக்கம்தரவு1 = உரலிபக்கம்1.text
			#print(உரலிபக்கம்தரவு2)
			
			
			
			if '-' in இடுஅட்டவணை or '(' in இடுஅட்டவணை: #re.search கொண்டு அனைத்துக் குறியீடுக்கும் ஏற்ப பகுப்பிட மாற்ற  வேண்டும்
				print(' தலைப்பில் குறியீடு உள்ளது.')
				தலைப்புபகுப்பு = '[[பகுப்பு:தலைப்பு மாற்றப்பட வேண்டிய அட்டவணைகள்]]'
				if தலைப்புபகுப்பு in உரலிபக்கம்தரவு1:
					print('தலைப்புபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('தலைப்புபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:தலைப்பு மாற்றப்பட வேண்டிய அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+ [[பகுப்பு:தலைப்பு மாற்றப்பட வேண்டிய அட்டவணைகள்]]')
					print('தலைப்புபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			if 'கராதி' in இடுஅட்டவணை:
				print(' தலைப்பில் குறிப்புள்ளது.')
				அகரமுதலிபகுப்பு = '[[பகுப்பு:அகரமுதலி அட்டவணைகள்]]'
				if அகரமுதலிபகுப்பு in உரலிபக்கம்தரவு1:
					print('அகரமுதலிபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('அகரமுதலிபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:அகரமுதலி அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+  [[பகுப்பு:அகரமுதலி அட்டவணைகள்]]')
					print('அகரமுதலிபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'களஞ்சிய' in இடுஅட்டவணை:
				print(' தலைப்பில் குறிப்புள்ளது.')
				களஞ்சியபகுப்பு = '[[பகுப்பு:கலைக்களஞ்சிய அட்டவணைகள்]]'
				if களஞ்சியபகுப்பு in உரலிபக்கம்தரவு1:
					print('களஞ்சியபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('களஞ்சியபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:கலைக்களஞ்சிய அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:கலைக்களஞ்சிய அட்டவணைகள்]]')
					print('களஞ்சியபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'கவிதை' in இடுஅட்டவணை or 'பாடல்' in இடுஅட்டவணை:
				print(' தலைப்பில் குறிப்புள்ளது.')
				களஞ்சியபகுப்பு = '[[பகுப்பு:கவிதை அட்டவணைகள்]]'
				if களஞ்சியபகுப்பு in உரலிபக்கம்தரவு1:
					print('கவிதைபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('கவிதைபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:கவிதை அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:கவிதை அட்டவணைகள்]]')
					print('கவிதைபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'சிறுகதை' in இடுஅட்டவணை or 'கதை' in இடுஅட்டவணை:
				print(' தலைப்பில் குறிப்புள்ளது.')
				களஞ்சியபகுப்பு = '[[பகுப்பு:சிறுகதைகளுள்ள அட்டவணைகள்]]'
				if களஞ்சியபகுப்பு in உரலிபக்கம்தரவு1:
					print('சிறுகதைபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('சிறுகதைபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:சிறுகதைகளுள்ள அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:சிறுகதைகளுள்ள அட்டவணைகள்]]')
					print('சிறுகதைபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'மொழிபெயர்ப்பு' in இடுஅட்டவணை: 
				print(' தலைப்பில் குறிப்புள்ளது.')
				மொழிபெயர்ப்புபகுப்பு = '[[பகுப்பு:மொழிபெயர்ப்பு அட்டவணைகள்]]'
				if மொழிபெயர்ப்புபகுப்பு in உரலிபக்கம்தரவு1:
					print('மொழிபெயர்ப்புபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('மொழிபெயர்ப்புபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:மொழிபெயர்ப்பு அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:மொழிபெயர்ப்பு அட்டவணைகள்]]')
					print('மொழிபெயர்ப்புபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'கட்டுரை' in இடுஅட்டவணை: 
				print(' தலைப்பில் குறிப்புள்ளது.')
				கட்டுரைபகுப்பு = '[[பகுப்பு:கட்டுரை அட்டவணைகள்]]'
				if கட்டுரைபகுப்பு in உரலிபக்கம்தரவு1:
					print('கட்டுரைபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('கட்டுரைபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:கட்டுரை அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:கட்டுரை அட்டவணைகள்]]')
					print('கட்டுரைபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'அறிவிய' in இடுஅட்டவணை: 
				print(' தலைப்பில் குறிப்புள்ளது.')
				அறிவியல்பகுப்பு = '[[பகுப்பு:அறிவியல் அட்டவணைகள்]]'
				if அறிவியல்பகுப்பு in உரலிபக்கம்தரவு1:
					print('அறிவியல்பகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('அறிவியல்பகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:அறிவியல் அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:அறிவியல் அட்டவணைகள்]]')
					print('அறிவியல்பகுப்பு  இடப்பட்டது.')
					time.sleep(15)
					

							
			elif 'வரலாறு' in இடுஅட்டவணை or 'சரித்திரம்' in இடுஅட்டவணை: 
				print(' தலைப்பில் குறிப்புள்ளது.')
				வரலாறுபகுப்பு = '[[பகுப்பு:வரலாற்று அட்டவணைகள்]]'
				if வரலாறுபகுப்பு in உரலிபக்கம்தரவு1:
					print('வரலாறுபகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('வரலாறுபகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:வரலாற்று அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:வரலாற்று அட்டவணைகள்]]')
					print('வரலாறுபகுப்பு  இடப்பட்டது.')
					time.sleep(15)
																
					

							
			elif 'தமிழ்' in இடுஅட்டவணை or 'தமிழ' in இடுஅட்டவணை: 
				print(' தலைப்பில் குறிப்புள்ளது.')
				இலக்கியப்பகுப்பு = '[[பகுப்பு:தமிழ் இலக்கிய அட்டவணைகள்]]'
				if இலக்கியப்பகுப்பு in உரலிபக்கம்தரவு1:
					print('இலக்கியப்பகுப்பு ஏற்கனவே உள்ளது.')
				else:
					print('இலக்கியப்பகுப்பு ஏற்கனவே இல்லை.')
					உரலிபக்கம்தரவு1புதிது = உரலிபக்கம்தரவு1 + '\n[[பகுப்பு:தமிழ் இலக்கிய அட்டவணைகள்]]'
					உரலிபக்கம்1.text = உரலிபக்கம்தரவு1புதிது
					உரலிபக்கம்1.save('+   [[பகுப்பு:தமிழ் இலக்கிய அட்டவணைகள்]]')
					print('இலக்கியப்பகுப்பு  இடப்பட்டது.')
					time.sleep(15)
																
																									
			
# ------------------- முடிவு:   ஒரு அட்டவணையின் பெயரினைக் கொண்டு, உரியப் பகுப்புகளை இடுகிறேன்.----------------------------			 
			


# ------------------- ஒரு அட்டவணையிலுள்ள பக்க எண்ணிக்கையின் அடிப்படையில் கீழ்கண்ட நிரலால் 16வகையானப் பகுப்புகளை இடுகிறேன்.----------------------------			
			# pywikibot என்ற பைத்தான் நூற்கட்டகத்தின் வழியே ஒரு அட்டவணைப் பக்கங்களின் எண்ணிக்கைக்கு ஏற்ப பக்கயெண்ணிக்கைப் பகுப்பிடுகிறேன்.
			மொழிதிட்டம்2 = pywikibot.Site('ta', 'wikisource')			
			உரலிபக்கம்2 = pywikibot.Page(மொழிதிட்டம்2,இடுஅட்டவணை)
			உரலிபக்கம்தரவு2 = உரலிபக்கம்2.text
			
			பக்கயெண்ணிக்கைப்பகுப்புக்குறி1 = 'வரை பக்கங்களுள்ள அட்டவணைகள்]]'
			பக்கயெண்ணிக்கைப்பகுப்புக்குறி2 = 'பக்கங்களுக்கு மேற்பட்ட அட்டவணைகள்]]'			
			if பக்கயெண்ணிக்கைப்பகுப்புக்குறி1 in உரலிபக்கம்தரவு2 or பக்கயெண்ணிக்கைப்பகுப்புக்குறி2 in உரலிபக்கம்தரவு2:
				print('பக்கயெண்ணிக்கைப் பகுப்பு உள்ளது.')
			else:
				print('பக்கயெண்ணிக்கைப் பகுப்பு இல்லை.')
				
				# பக்கயெண்ணிக்கைப் பகுப்பிட, குறிப்பிட்ட அட்டவணை வகைகளை எடுத்துக் கொள்கிறேன்.
				if 'Progress=C' in உரலிபக்கம்தரவு2 or 'Progress=L' in உரலிபக்கம்தரவு2 or 'Progress=OCR' in உரலிபக்கம்தரவு2:# Progress=C பகுப்பு:Index Not-Proofread /  Progress=L பகுப்பு:Index - File to fix 
					print('பகுப்பு மேலாண்மை செய்ய வேண்டிய அட்டவணை')
					
	
						
					if அட்டவணைமொத்தப்பக்கங்கள் <51:
						print(இடுஅட்டவணை + ' என்பது, 50 பக்கங்களுக்கும் குறைவாகவுள்ள மின்னூல் ஆகும்.')
						பகுப்புத்தேடு1 = '1 முதல் 50 வரை பக்கங்களுள்ள அட்டவணைகள்' #இப்பகுப்பினை இல்லையெனில், பக்கங்களை கணக்கிட்டு இணைக்க வேண்டும்.
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n') 
							விளைவிடு(கோடிடு)
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:1 முதல் 50 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:1 முதல் 50 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
											
					elif அட்டவணைமொத்தப்பக்கங்கள் <101:
						print(இடுஅட்டவணை + ' என்பது, 51-100 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '51 முதல் 100 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                  
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:51 முதல் 100 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:51 முதல் 100 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
											
					elif அட்டவணைமொத்தப்பக்கங்கள் < 151:
						print(இடுஅட்டவணை + ' என்பது, 101-150 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '101 முதல் 150 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:101 முதல் 150 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:101 முதல் 150 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')              
											
					elif அட்டவணைமொத்தப்பக்கங்கள் < 201:
						print(இடுஅட்டவணை + ' என்பது, 151-200 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '151 முதல் 200 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)                
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:151 முதல் 200 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:151 முதல் 200 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
											
						
					elif அட்டவணைமொத்தப்பக்கங்கள் < 251:
						print(இடுஅட்டவணை + ' என்பது, 201-250 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '201 முதல் 250 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)              
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:201 முதல் 250 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:201 முதல் 250 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
											
					elif அட்டவணைமொத்தப்பக்கங்கள் < 301:
						print(இடுஅட்டவணை + ' என்பது, 251-300 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '251 முதல் 300 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                   
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:251 முதல் 300 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:251 முதல் 300 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 351:
						print(இடுஅட்டவணை + ' என்பது, 301-350 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '301 முதல் 350 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)             
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:301 முதல் 350 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:301 முதல் 350 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')	
															
					elif அட்டவணைமொத்தப்பக்கங்கள் < 401:
						print(இடுஅட்டவணை + ' என்பது, 351-400 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '351 முதல் 400 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.') 
							விளைவிடு(கோடிடு)                  
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:351 முதல் 400 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:351 முதல் 400 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 451:
						print(இடுஅட்டவணை + ' என்பது, 401-450 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '401 முதல் 450 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                   
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:401 முதல் 450 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:401 முதல் 450 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 501:
						print(இடுஅட்டவணை + ' என்பது, 451-500 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '451 முதல் 500 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)             
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                  
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:451 முதல் 500 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:451 முதல் 500 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 601:
						print(இடுஅட்டவணை + ' என்பது, 501-600 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '501 முதல் 600 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)              
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:501 முதல் 600 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:501 முதல் 600 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 701:
						print(இடுஅட்டவணை + ' என்பது, 601-700 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.')
						பகுப்புத்தேடு1 = '601 முதல் 700 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு) 
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)               
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:601 முதல் 700 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:601 முதல் 700 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 801:
						print(இடுஅட்டவணை + ' என்பது, 701-800 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.') 
						பகுப்புத்தேடு1 = '701 முதல் 800 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)               
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                   
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:701 முதல் 800 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:701 முதல் 800 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 901:
						print(இடுஅட்டவணை + ' என்பது, 801-900 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.') 
						பகுப்புத்தேடு1 = '801 முதல் 900 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)                
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                   
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:801 முதல் 900 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:801 முதல் 900 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் < 1001:
						print(இடுஅட்கவிதைடவணை + ' என்பது, 901-1000 பக்கங்களுக்கு இடைபட்ட அட்டவணை ஆகும்.') 
						பகுப்புத்தேடு1 = '901 முதல் 1000 வரை பக்கங்களுள்ள அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)     
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                  
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:901 முதல் 1000 வரை பக்கங்களுள்ள அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:901 முதல் 1000 வரை பக்கங்களுள்ள அட்டவணைகள்|பகுப்பு மேம்பாடு]]')                
												
					elif அட்டவணைமொத்தப்பக்கங்கள் > 1001:
						print(இடுஅட்டவணை + ' என்பது, 1000 பக்கங்களுக்கு மேற்பட்ட மின்னூல் ஆகும்.')
						பகுப்புத்தேடு1 = '1000 பக்கங்களுக்கு மேற்பட்ட அட்டவணைகள்'          
						if பகுப்புத்தேடு1 in உரலிபக்கம்தரவு2:
							print('மாற்றும் பகுப்பு ஏற்கனவே உள்ளது.\n')
							விளைவிடு(கோடிடு)               
						else:
							print(பகுப்புத்தேடு1 + ' என்ற பகுப்பு இல்லை.')
							விளைவிடு(கோடிடு)                    
							உரலிபக்கம்தரவு2புதிது = உரலிபக்கம்தரவு2 + '\n[[பகுப்பு:1000 பக்கங்களுக்கு மேற்பட்ட அட்டவணைகள்]]'
							உரலிபக்கம்2.text  = உரலிபக்கம்தரவு2புதிது
							உரலிபக்கம்2.save('+ [[பகுப்பு:1000 பக்கங்களுக்கு மேற்பட்ட அட்டவணைகள்|பகுப்பு மேம்பாடு]]')
							
							                
												
				else:
					print('"Index Not-Proofread" என்ற பகுப்பில்லை. எனவே, அடுத்த அட்டவணைக்கு...')
					
					
					
		else:
			print(இடுஅட்டவணை + ' (இடுஅட்டவணைப் பெயரை சரிபார்)\n')
#try:
#except:
	#print("\n'IndexError: list index out of range ='உள்ளீடு இல்லை \n")	
	
				
				
 
			

#-------------------    எண்ணுன்மிகள் குறித்த இறுதி விளைவுகளை, பேச்சுப்பக்கத்தில் எழுதுகிறேன்.	--------------------	
            
			#இடுஅட்டவணைபேச்சு = இடுஅட்டவணை.replace('அட்டவணை','அட்டவணை_பேச்சு')
			#இடுஅட்டவணைக்கோப்பு = இடுஅட்டவணை.replace('அட்டவணை','').replace(':','').replace('.pdf','') .replace('.djvu','') + '.csv' 
			#இடுஅட்டவணைக்கோப்பு2 = '0-1-' + இடுஅட்டவணைக்கோப்பு
			#இடுஅட்டவணைக்கோப்புக்குறி = இடுஅட்டவணைக்கோப்பு.replace('.csv','')         
			#print(இடுஅட்டவணைக்கோப்புக்குறி)


# ------------  கோட்டிற்கு கீழுள்ளவை,  நிரலுக்கான முன்னேற்பாடுகள், பிறகு  இவை பின்னர் பயன்படக்கூடியன. ----------------------------------------------------------

# 1000 எண்ணுன்மிகள் உள்ள பக்கங்களைத் தானியக்கமாக எழுதும் கோப்பின் பெயர். இக்கோப்பு நிரலால் உருவாக்கப்படுகிறது.
#எண்ணுன்மிகள்கோப்பு = '0-1-பார்த்தநூற்ப்பக்கம்.csv'
# மேற்கண்டக்கோப்பில், அட்டவணைப்பேச்சுப்பக்கத்தில் இடவுள்ள குறிப்புகள்.
#பேச்சுக்குறிப்பு1 =  '''
#==1000 எண்ணுன்மிகள் (bytes) உள்ள பக்கங்கள் ==
#[[பகுப்பு:1000 எண்ணுன்மிகள் பக்க அளவிட்ட அட்டவணைகள்]]இந்நூல் அட்டவணையில், 1000 எண்ணுன்மிகள் உள்ள பக்கங்கள் உள்ளனவா, என ஆய்ந்தறியப்பட்டன.\n''' 
#பேச்சுக்குறிப்பு2 = '\nமேற்கண்டப் பக்கங்களை முதலில் மேம்படுத்தக் கோருகிறேன். ஏனெனில், இவற்றில் பலவகை விக்கிநுட்பங்கள் தேவைப்படுகின்றன.  பிறகு, புதியவர்களும் மற்றப் பக்கங்களைச் செய்வது எளிதாகும்.' 

#-----------  கோட்டிற்கு மேலுள்ளவை பின்வரும் நிரல்களில் பயன்படக்கூடியன. ---------------------------------------------------------------
